Revit 2027 API
ParameterTypeId.AssignTemplateOnViewCreation Property
 "New views are dependent on template"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AssignTemplateOnViewCreation { get; }
Public Shared ReadOnly Property AssignTemplateOnViewCreation As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AssignTemplateOnViewCreation {
	ForgeTypeId^ get ();
}
static member AssignTemplateOnViewCreation : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace